PImage img;
int [][] pos={{91,490},{247,525},{178,525},{160,489},{151,456},{194,489},{230,488},{261,490},{322,455},{298,489},{331,489},{368,490},{314,524},{281,524},{357,453},{390,454},{85,456},{185,456},{127,489},{219,457},{288,457},{212,523},{117,456},{143,523},{253,457},{109,522}};
void setup(){
  size(800,600);
  img = loadImage("keyboard.png");
  rectMode(CENTER); // 中心點畫四邊形
}
void draw(){
  background(#FFFFF2); //淡黃
  image(img, 0, 600-266);
  fill(255,0,0, 128);//半透明
  rect(mouseX,mouseY, 28,30, 5); //圓角
  
  fill(0,255,0, 128);
  for(int i=0; i<26;i++){
    rect(pos[i][0], pos[i][1],28,30,5); // 在pos(x,y)顯示綠色半
  }
}
void mousePressed(){
  println(mouseX, mouseY); //定位，印出mouse座標透明
}
